-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Дек 26 2019 г., 15:12
-- Версия сервера: 10.3.13-MariaDB-log
-- Версия PHP: 7.1.32

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `shop`
--

-- --------------------------------------------------------

--
-- Структура таблицы `basket`
--

CREATE TABLE `basket` (
  `id` int(11) NOT NULL,
  `good` int(11) NOT NULL,
  `quantity` int(11) NOT NULL,
  `user` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `brands`
--

CREATE TABLE `brands` (
  `id` int(11) NOT NULL,
  `name` varchar(40) NOT NULL,
  `description` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `brands`
--

INSERT INTO `brands` (`id`, `name`, `description`) VALUES
(1, 'SPICERACK.RU', ''),
(2, 'Адыгейская соль', '');

-- --------------------------------------------------------

--
-- Структура таблицы `countries`
--

CREATE TABLE `countries` (
  `code` int(10) NOT NULL,
  `name` varchar(250) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `countries`
--

INSERT INTO `countries` (`code`, `name`) VALUES
(36, 'АВСТРАЛИЯ'),
(40, 'АВСТРИЯ'),
(31, 'АЗЕРБАЙДЖАН'),
(8, 'АЛБАНИЯ'),
(12, 'АЛЖИР'),
(660, 'АНГИЛЬЯ'),
(24, 'АНГОЛА'),
(20, 'АНДОРРА'),
(10, 'АНТАРКТИДА'),
(28, 'АНТИГУА И БАРБУДА'),
(32, 'АРГЕНТИНА'),
(51, 'АРМЕНИЯ'),
(533, 'АРУБА'),
(4, 'АФГАНИСТАН'),
(44, 'БАГАМЫ'),
(50, 'БАНГЛАДЕШ'),
(52, 'БАРБАДОС'),
(48, 'БАХРЕЙН'),
(112, 'БЕЛАРУСЬ'),
(84, 'БЕЛИЗ'),
(56, 'БЕЛЬГИЯ'),
(204, 'БЕНИН'),
(60, 'БЕРМУДЫ'),
(100, 'БОЛГАРИЯ'),
(68, 'БОЛИВИЯ'),
(70, 'БОСНИЯ И ГЕРЦЕГОВИНА'),
(72, 'БОТСВАНА'),
(76, 'БРАЗИЛИЯ'),
(86, 'БРИТАН. ТЕРРИТ.'),
(96, 'БРУНЕЙ'),
(74, 'БУВЕ'),
(854, 'БУРКИНА-ФАСО'),
(108, 'БУРУНДИ'),
(64, 'БУТАН'),
(548, 'ВАНУАТУ'),
(336, 'ВАТИКАН'),
(348, 'ВЕНГРИЯ'),
(862, 'ВЕНЕСУЭЛА'),
(850, 'ВИРГИН. О-ВА'),
(92, 'ВИРГИН. О-ВА, БРИТАНСКИЕ'),
(16, 'ВОСТОЧНОЕ САМОА'),
(704, 'ВЬЕТНАМ'),
(266, 'ГАБОН'),
(332, 'ГАИТИ'),
(328, 'ГАЙАНА'),
(270, 'ГАМБИЯ'),
(288, 'ГАНА'),
(312, 'ГВАДЕЛУПА'),
(320, 'ГВАТЕМАЛА'),
(254, 'ГВИАНА'),
(324, 'ГВИНЕЯ'),
(624, 'ГВИНЕЯ-БИСАУ'),
(276, 'ГЕРМАНИЯ'),
(831, 'ГЕРНСИ'),
(292, 'ГИБРАЛТАР'),
(340, 'ГОНДУРАС'),
(344, 'ГОНКОНГ'),
(308, 'ГРЕНАДА'),
(304, 'ГРЕНЛАНДИЯ'),
(300, 'ГРЕЦИЯ'),
(268, 'ГРУЗИЯ'),
(316, 'ГУАМ'),
(208, 'ДАНИЯ'),
(832, 'ДЖЕРСИ'),
(262, 'ДЖИБУТИ'),
(212, 'ДОМИНИКА'),
(214, 'ДОМИНИКАНСКАЯ РЕСПУБЛИКА'),
(818, 'ЕГИПЕТ'),
(894, 'ЗАМБИЯ'),
(732, 'ЗАПАДНАЯ САХАРА'),
(716, 'ЗИМБАБВЕ'),
(376, 'ИЗРАИЛЬ'),
(356, 'ИНДИЯ'),
(360, 'ИНДОНЕЗИЯ'),
(400, 'ИОРДАНИЯ'),
(368, 'ИРАК'),
(364, 'ИРАН'),
(372, 'ИРЛАНДИЯ'),
(352, 'ИСЛАНДИЯ'),
(724, 'ИСПАНИЯ'),
(380, 'ИТАЛИЯ'),
(887, 'ЙЕМЕН'),
(132, 'КАБО-ВЕРДЕ'),
(398, 'КАЗАХСТАН'),
(136, 'КАЙМАН'),
(116, 'КАМБОДЖА'),
(120, 'КАМЕРУН'),
(124, 'КАНАДА'),
(634, 'КАТАР'),
(404, 'КЕНИЯ'),
(196, 'КИПР'),
(296, 'КИРИБАТИ'),
(156, 'КИТАЙ'),
(166, 'КОКОСОВЫЕ О-ВА'),
(170, 'КОЛУМБИЯ'),
(174, 'КОМОРЫ'),
(178, 'КОНГО'),
(180, 'КОНГО'),
(410, 'КОРЕЯ'),
(408, 'КОРЕЯ (КНДР)'),
(188, 'КОСТА-РИКА'),
(384, 'КОТ Д\'ИВУАР'),
(192, 'КУБА'),
(414, 'КУВЕЙТ'),
(417, 'КЫРГЫЗСТАН'),
(418, 'ЛАОС'),
(428, 'ЛАТВИЯ'),
(426, 'ЛЕСОТО'),
(430, 'ЛИБЕРИЯ'),
(422, 'ЛИВАН'),
(434, 'ЛИВИЯ'),
(440, 'ЛИТВА'),
(438, 'ЛИХТЕНШТЕЙН'),
(442, 'ЛЮКСЕМБУРГ'),
(480, 'МАВРИКИЙ'),
(478, 'МАВРИТАНИЯ'),
(450, 'МАДАГАСКАР'),
(175, 'МАЙОТТА'),
(446, 'МАКАО'),
(807, 'МАКЕДОНИЯ'),
(454, 'МАЛАВИ'),
(458, 'МАЛАЙЗИЯ'),
(466, 'МАЛИ'),
(581, 'МАЛЫЕ ТИХООК. ОСТРОВА (США)'),
(462, 'МАЛЬДИВЫ'),
(470, 'МАЛЬТА'),
(580, 'МАРИАНСКИЕ ОСТРОВА'),
(504, 'МАРОККО'),
(474, 'МАРТИНИКА'),
(584, 'МАРШАЛЛОВЫ ОСТРОВА'),
(484, 'МЕКСИКА'),
(583, 'МИКРОНЕЗИЯ'),
(508, 'МОЗАМБИК'),
(498, 'МОЛДОВА'),
(492, 'МОНАКО'),
(496, 'МОНГОЛИЯ'),
(500, 'МОНТСЕРРАТ'),
(104, 'МЬЯНМА'),
(516, 'НАМИБИЯ'),
(520, 'НАУРУ'),
(524, 'НЕПАЛ'),
(562, 'НИГЕР'),
(566, 'НИГЕРИЯ'),
(530, 'НИДЕРЛАНДСКИЕ АНТИЛЫ'),
(528, 'НИДЕРЛАНДЫ'),
(558, 'НИКАРАГУА'),
(570, 'НИУЭ'),
(554, 'НОВАЯ ЗЕЛАНДИЯ'),
(540, 'НОВАЯ КАЛЕДОНИЯ'),
(578, 'НОРВЕГИЯ'),
(574, 'НОРФОЛК'),
(784, 'ОБЪЕД. АРАБСКИЕ ЭМИРАТЫ'),
(833, 'О-В МЭН'),
(162, 'О-В РОЖДЕСТВА'),
(184, 'О-ВА КУКА'),
(512, 'ОМАН'),
(586, 'ПАКИСТАН'),
(585, 'ПАЛАУ'),
(275, 'ПАЛЕСТИНСКАЯ ТЕРРИТОРИЯ, ОККУПИРОВАННАЯ'),
(591, 'ПАНАМА'),
(598, 'ПАПУА - НОВАЯ ГВИНЕЯ'),
(600, 'ПАРАГВАЙ'),
(604, 'ПЕРУ'),
(612, 'ПИТКЭРН'),
(616, 'ПОЛЬША'),
(620, 'ПОРТУГАЛИЯ'),
(630, 'ПУЭРТО-РИКО'),
(638, 'РЕЮНЬОН'),
(643, 'РОССИЯ'),
(646, 'РУАНДА'),
(642, 'РУМЫНИЯ'),
(882, 'САМОА'),
(678, 'САН-ТОМЕ И ПРИНСИПИ'),
(674, 'САН-МАРИНО'),
(682, 'САУДОВСКАЯ АРАВИЯ'),
(748, 'СВАЗИЛЕНД'),
(654, 'СВЯТАЯ ЕЛЕНА'),
(690, 'СЕЙШЕЛЫ'),
(666, 'СЕН-ПЬЕР И МИКЕЛОН'),
(686, 'СЕНЕГАЛ'),
(670, 'СЕНТ-ВИНСЕНТ И ГРЕНАДИНЫ'),
(659, 'СЕНТ-КИТС И НЕВИС'),
(662, 'СЕНТ-ЛЮСИЯ'),
(688, 'СЕРБИЯ'),
(702, 'СИНГАПУР'),
(760, 'СИРИЯ'),
(703, 'СЛОВАКИЯ'),
(705, 'СЛОВЕНИЯ'),
(826, 'СОЕДИНЕННОЕ КОРОЛЕВСТВО'),
(90, 'СОЛОМОНОВЫ О-ВА'),
(706, 'СОМАЛИ'),
(736, 'СУДАН'),
(740, 'СУРИНАМ'),
(840, 'США'),
(694, 'СЬЕРРА-ЛЕОНЕ'),
(762, 'ТАДЖИКИСТАН'),
(764, 'ТАИЛАНД'),
(158, 'ТАЙВАНЬ'),
(834, 'ТАНЗАНИЯ'),
(796, 'ТЕРКС И КАЙКОС'),
(626, 'ТИМОР-ЛЕСТЕ'),
(768, 'ТОГО'),
(772, 'ТОКЕЛАУ'),
(776, 'ТОНГА'),
(780, 'ТРИНИДАД И ТОБАГО'),
(798, 'ТУВАЛУ'),
(788, 'ТУНИС'),
(795, 'ТУРКМЕНИЯ'),
(792, 'ТУРЦИЯ'),
(800, 'УГАНДА'),
(860, 'УЗБЕКИСТАН'),
(804, 'УКРАИНА'),
(876, 'УОЛЛИС И ФУТУНА'),
(858, 'УРУГВАЙ'),
(234, 'ФАРЕРСКИЕ О-ВА'),
(242, 'ФИДЖИ'),
(608, 'ФИЛИППИНЫ'),
(246, 'ФИНЛЯНДИЯ'),
(238, 'ФОЛКЛЕНДСКИЕ О-ВА'),
(260, 'ФР. ЮЖНЫЕ ТЕРРИТОРИИ'),
(250, 'ФРАНЦИЯ'),
(258, 'ФРАНЦУЗСКАЯ ПОЛИНЕЗИЯ'),
(334, 'ХЕРД И МАКДОНАЛЬД'),
(191, 'ХОРВАТИЯ'),
(140, 'ЦЕНТР. - АФР. РЕСПУБЛИКА'),
(148, 'ЧАД'),
(499, 'ЧЕРНОГОРИЯ'),
(203, 'ЧЕХИЯ'),
(152, 'ЧИЛИ'),
(756, 'ШВЕЙЦАРИЯ'),
(752, 'ШВЕЦИЯ'),
(744, 'ШПИЦБЕРГЕН И ЯН-МАЙЕН'),
(144, 'ШРИ-ЛАНКА'),
(218, 'ЭКВАДОР'),
(226, 'ЭКВАТОРИАЛЬНАЯ ГВИНЕЯ'),
(248, 'ЭЛАНДСКИЕ ОСТРОВА'),
(222, 'ЭЛЬ-САЛЬВАДОР'),
(232, 'ЭРИТРЕЯ'),
(233, 'ЭСТОНИЯ'),
(231, 'ЭФИОПИЯ'),
(710, 'ЮЖНАЯ АФРИКА'),
(239, 'ЮЖНАЯ ДЖОРДЖИЯ И ЮЖНЫЕ САНДВИЧЕВЫ ОСТРОВА'),
(388, 'ЯМАЙКА'),
(392, 'ЯПОНИЯ');

-- --------------------------------------------------------

--
-- Структура таблицы `goods`
--

CREATE TABLE `goods` (
  `id` int(11) NOT NULL,
  `sku` varchar(20) NOT NULL,
  `name` varchar(40) NOT NULL,
  `brand` int(11) NOT NULL,
  `origin` int(11) NOT NULL,
  `weight` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `image` varchar(20) NOT NULL,
  `description` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `goods`
--

INSERT INTO `goods` (`id`, `sku`, `name`, `brand`, `origin`, `weight`, `price`, `image`, `description`) VALUES
(1, 'А001', 'Перец черный горошек', 1, 356, 1000, 1150, '533.750.jpg', 'Являясь универсальной пряностью, чёрный перец находит себе самое широкое применение — его добавляют в супы, подливки, соусы, овощные салаты, маринады, используют при приготовлении всех видов мяса, капусты, фасоли, гороха, яиц, сыров, томатов, рыбы и других блюд.'),
(2, 'А002', 'Корица молотая', 1, 360, 450, 515, '25.750.jpg', 'Молотая корица чаще всего добавляется в тесто, салаты, вторые блюда, при этом закладку производят за 7-10 минут до готовности блюда (супы, компоты, горячие блюда) или непосредственно перед подачей на стол (салаты, творожные пасты). На 1 кг. риса, мяса или на 1 л. жидкости требуется от 0,5 до 1 ч. л. корицы.'),
(3, 'А003', 'Перец сычуаньский', 1, 156, 1000, 3300, '532.750.jpg', 'Эту пряность используют во многих азиатских кухнях: в блюдах из рыбы, морепродуктов, свинины, птицы. В Корее, Японии и Китае его добавляют в кондитерские изделия: компоты, кисели, варенья — он прекрасно сочетается с корицей, бадьяном, имбирём и многими другими пряностями сладкой группы.'),
(4, 'А005', 'Абадзехская соль Адыгейская', 2, 643, 300, 87, '1125.750.jpg', 'Состав: соль поваренная пищевая, чеснок, кориандр, перец черный, укроп, петрушка.'),
(5, 'А004', 'Бадьян (звёздчатый анис)', 1, 704, 75, 240, '5.750.jpg', 'Бадьян применяется при приготовлении алкогольных напитков и мучных изделий. Высушенные плоды прекрасно сочетаются с корицей, мускатным орехом, имбирем, кардамоном и гвоздикой.');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `login` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(40) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(40) COLLATE utf8mb4_unicode_ci NOT NULL,
  `phone` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(40) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `login`, `password`, `email`, `phone`, `name`) VALUES
(500, 'anonymous', '', '', '', 'Анонимус');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `basket`
--
ALTER TABLE `basket`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `brands`
--
ALTER TABLE `brands`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `countries`
--
ALTER TABLE `countries`
  ADD PRIMARY KEY (`code`);

--
-- Индексы таблицы `goods`
--
ALTER TABLE `goods`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `basket`
--
ALTER TABLE `basket`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=64;

--
-- AUTO_INCREMENT для таблицы `brands`
--
ALTER TABLE `brands`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `goods`
--
ALTER TABLE `goods`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=501;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
